RDVMI.rdvmi-ext/src/InformationRegisters/рдв_РегистрацияИзменений/рдв_РегистрацияИзменений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рдв_РегистрацияИзменений</name>
  <resources>
    <name>ВыгружаемыйОбъект</name>
    <type>
      <types>CatalogRef.рдв_ВыгружаемыеОбъекты</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.рдв_СтатусыРегистрацииИзменений</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>АдресМетода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСообщения</name>
    <type>
      <types>CatalogRef.рдв_ВидыСообщенийИнтеграции</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДатаРегистрацииВМиллисекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВнешняяСистема</name>
    <type>
      <types>CatalogRef.рдв_ВнешниеСистемы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RDVMI.rdvmi-ext/src/InformationRegisters/рдв_РегистрацияИзменений/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура СформироватьСообщения()
	
	Если Элементы.Список.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеВыгрузки = Новый Соответствие;
	Для Каждого Строка Из Элементы.Список.ВыделенныеСтроки Цикл
		Запись = РегистрыСведений.рдв_РегистрацияИзменений.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Строка);
		Запись.Прочитать();
		ВнешняяСистема = Запись.ВнешняяСистема;
		МассивИдентификаторов = ДанныеВыгрузки.Получить(ВнешняяСистема);
		Если МассивИдентификаторов = Неопределено Тогда
			МассивИдентификаторов = Новый Массив;
		КонецЕсли;
		МассивИдентификаторов.Добавить(Строка.ИдентификаторСообщения);
		ДанныеВыгрузки.Вставить(ВнешняяСистема, МассивИдентификаторов);
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из ДанныеВыгрузки Цикл
		Попытка
			рдв_Интеграция.СообщениеСформировать(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		Исключение
			Сообщить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыгрузку(Команда)
	СформироватьСообщения();
	Элементы.Список.Обновить();
КонецПроцедуры
